const numbers = [
  {
    phone: '9344449444',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9944444544',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9848886888',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9816666664',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9845555553',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9938889888',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9344448444',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9950000044',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9849994999',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9849992999',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9928889888',
    tariff: 'Тариф 1500',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9836661111',
    tariff: 'Тариф 1000',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9324446444',
    tariff: 'Тариф 1000',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9836668666',
    tariff: 'Тариф 1000',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9816665666',
    tariff: 'Тариф 1000',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9314446444',
    tariff: 'Тариф 1000',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9326668666',
    tariff: 'Тариф 1000',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9582229222',
    tariff: 'Тариф 1000',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9315556555',
    tariff: 'Тариф 1000',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9942225222',
    tariff: 'Тариф 1000',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9315552555',
    tariff: 'Тариф 1000',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9397777763',
    tariff: 'Тариф 600',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9240777700',
    tariff: 'Тариф 600',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9347777337',
    tariff: 'Тариф 600',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9347771177',
    tariff: 'Тариф 600',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9311777171',
    tariff: 'Тариф 600',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9046320000',
    tariff: 'Тариф 600',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9239000099',
    tariff: 'Тариф 600',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9337777760',
    tariff: 'Тариф 600',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  },
  {
    phone: '9006556666',
    tariff: 'Тариф 600',
    more: 'Регион: Москва<br>Минуты: Безлимит<br>Интернет: 100 Гб'
  }
];

const initData = () => {
  for (let i = 0; i < numbers.length; i++) {
    const list = document.querySelector('.phone__list');
    list.innerHTML += `<li class="phone__item">
        <div>
          <span class="phone__number">${numbers[i].phone}</span>
          <span class="phone__name-tariff">${numbers[i].tariff}</span>
          <i class="phone__info-icon"></i>
          <p class="phone__more">${numbers[i].more}</p>
        </div>
        <button class="phone__book">Забронировать</button>
      </li>`;
  }
}
document.addEventListener('DOMContentLoaded', initData);